{
  "projects": [
    {
      "id": 1,
      "title": {
        "en": "Personal CV",
        "es": "CV Personal"
      },
      "description": {
        "en": "I developed my first web project to present my CV as a civil engineer in a clear and visually appealing way. It includes a section with my academic projects, my contact information, and a form that allows users to send me messages directly through the interface.\n\nThe frontend was built with HTML, CSS, and JavaScript, focusing on simple and intuitive navigation.\nThe backend was developed with Django, using PostgreSQL databases hosted on Supabase.\nImages are managed through Django's admin panel and dynamically loaded from Supabase.\nThe project is deployed on Vercel, ensuring fast and reliable access.\nVersion control is handled with Git/GitHub.",
        "es": "Desarrollé mi primer proyecto web para presentar mi CV como ingeniero civil de forma clara y atractiva. Incluye una sección con mis proyectos académicos, mis medios de contacto y un formulario que permite enviarme mensajes directamente desde la interfaz.\n\nEl frontend fue construido con HTML, CSS y JavaScript, priorizando una navegación simple e intuitiva.\nEl backend está desarrollado en Django, con bases de datos PostgreSQL alojadas en Supabase.\nLas imágenes se gestionan desde el panel de administración de Django y se cargan dinámicamente desde Supabase.\nEl proyecto está desplegado en Vercel, asegurando un acceso rápido y confiable.\nEl control de versiones se gestiona mediante Git/GitHub."
      },
      "tools": ["JavaScript", "HTML", "CSS", "Django", "Git", "GitHub"],
      "image_path": "/images/Personal-CV-icon.jpg",
      "github_url": "https://github.com/joselriascos/Personal_CV",
      "site_url": "https://joselriascos.vercel.app/",
      "iframeConflict": true
    },
    {
      "id": 2,
      "title": {
        "en": "Pokemon searcher",
        "es": "Pokemon searcher"
      },
      "description": {
        "en": "I developed a web application to explore Pokémon data using the PokéAPI REST API. The interface is intuitive and fully responsive.\n\nThe project was built entirely with React, with no additional external dependencies, and is deployed on Netlify for fast and reliable access.\nVersion control is handled with Git/GitHub.",
        "es": "Desarrollé una aplicación web para consultar información de Pokémon utilizando la API REST de PokéAPI. La interfaz es intuitiva y responsiva.\n\nEl proyecto fue desarrollado completamente con React, sin dependencias externas adicionales, y está desplegado en Netlify para un acceso rápido y estable.\nEl control de versiones se gestiona mediante Git/GitHub."
      },
      "tools": ["React", "HTML", "CSS", "Git", "GitHub"],
      "image_path": "/images/Pokemon-searcher-icon.webp",
      "github_url": "https://github.com/joselriascos/pokemon_searcher",
      "site_url": "https://joselriascos-pokemon-searcher.netlify.app/",
      "iframeConflict": false
    },
    {
      "id": 3,
      "title": {
        "en": "React Redux CRUD",
        "es": "CRUD React Redux"
      },
      "description": {
        "en": "I developed a user management CRUD application that, while simple in appearance, offers a complete and robust implementation behind the scenes. The project is built with React and TypeScript, ensuring type safety and maintainable code.\n\nStyling is handled with TailwindCSS for a clean and responsive design. State management is implemented using Redux Toolkit, including custom middlewares that handle data persistence through a backend developed with Node.js and Express.js. The application temporarily uses a JSON file as a mock database while the implementation of a MongoDB database is being completed.\n\nVersion control is managed with Git/GitHub, and the project is deployed on Netlify with continuous deployment triggered automatically on each push.",
        "es": "Desarrollé una aplicación CRUD de gestión de usuarios que, aunque simple en apariencia, ofrece una implementación completa y robusta en su funcionamiento interno. El proyecto está construido con React y TypeScript, lo que garantiza seguridad de tipos y un código mantenible.\n\nLos estilos están implementados con TailwindCSS para lograr un diseño limpio y adaptable. El manejo del estado global se realiza con Redux Toolkit, incluyendo middlewares personalizados que gestionan la persistencia de datos a través de un backend desarrollado con Node.js y Express.js. La aplicación utiliza temporalmente un archivo JSON como base de datos simulada mientras se completa la implementación de una base de datos MongoDB.\n\nEl control de versiones se gestiona con Git/GitHub, y el proyecto está desplegado en Netlify con despliegue continuo que se actualiza automáticamente con cada push."
      },
      "tools": [
        "React",
        "Redux",
        "HTML",
        "TailwindCSS",
        "TypeScript",
        "Git",
        "GitHub"
      ],
      "image_path": "/images/CRUD-redux-icon.png",
      "github_url": "https://github.com/joselriascos/Aprendiendo-React/tree/main/projects/09-crud-react-redux",
      "site_url": "https://joselriascos-crud-redux-toolkit.netlify.app/",
      "iframeConflict": false
    },
    {
      "id": 4,
      "title": {
        "en": "Web Portfolio",
        "es": "Portafolio Web"
      },
      "description": {
        "en": "I developed a personal portfolio website to showcase my background and experience as a web developer. It includes sections with my projects, my tech stack, and contact links, providing visitors with a clear overview of my work and skills.\n\nThe frontend was built with React, featuring smooth navigation managed with React Router.\nVersion control is handled with Git/GitHub, ensuring consistent updates and collaboration.\nI am currently working on implementing the backend using Node.js and Express to expand the site’s functionality.",
        "es": "Desarrollé un sitio web de portafolio personal para mostrar mi trayectoria y experiencia como desarrollador web. Incluye secciones con mis proyectos, mi stack tecnológico y enlaces de contacto, ofreciendo a los visitantes una visión clara de mi trabajo y habilidades.\n\nEl frontend fue construido con React, con una navegación fluida gestionada mediante React Router.\nEl control de versiones se maneja con Git/GitHub, garantizando actualizaciones consistentes y colaboración.\nActualmente estoy trabajando en la implementación del backend utilizando Node.js y Express para ampliar la funcionalidad del sitio."
      },
      "tools": ["JavaScript", "React", "HTML", "CSS", "Git", "GitHub"],
      "image_path": "/favicon.png",
      "github_url": "https://github.com/joselriascos/Personal_CV",
      "site_url": "https://joselriascos-portfolio.netlify.app/",
      "iframeConflict": false
    },
    {
      "id": 5,
      "title": {
        "en": "Random quote machine",
        "es": "Máquina de citas aleatorias"
      },
      "description": {
        "en": "I developed a simple web application that displays random famous quotes and allows users to share them on Twitter through a minimalist and user-friendly interface.\n\nThe project was built with HTML, JavaScript, and TailwindCSS, and is deployed on Netlify for fast and reliable access.\nVersion control is handled with Git/GitHub.",
        "es": "Desarrollé una aplicación web sencilla que muestra citas famosas de manera aleatoria y permite compartirlas en Twitter mediante una interfaz minimalista y agradable para el usuario.\n\nEl proyecto fue desarrollado con HTML, JavaScript y TailwindCSS, y está desplegado en Netlify para un acceso rápido y confiable.\nEl control de versiones se gestiona mediante Git/GitHub."
      },
      "tools": ["JavaScript", "TailwindCSS", "HTML", "Git", "GitHub"],
      "image_path": "/images/Random-quote-machine-icon.jpg",
      "github_url": "https://github.com/joselriascos/random-quote-machine",
      "site_url": "https://joselriascos.github.io/random-quote-machine/",
      "iframeConflict": false
    }
  ]
}
